# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

quarterNumber = int(input('Введите номер координатной четверти: '))
while not 0<quarterNumber<5:
    quarterNumber = int(input('Введите номер координатной четверти от 1-го до 4-ёх: '))

if quarterNumber == 1:
    print('Координата X > 0 (X не равен 0) и Координата Y > 0 (Y не равен 0)')
elif quarterNumber == 2:
    print('Координата X < 0 (X не равен 0) и Координата Y > 0 (Y не равен 0)')
elif quarterNumber == 3:
    print('Координата X < 0 (X не равен 0) и Координата Y < 0 (Y не равен 0)')
elif quarterNumber == 4:
    print('Координата X > 0 (X не равен 0) и Координата Y < 0 (Y не равен 0)')